tests/fixtures/cassettes/test_find_zip_code.yaml

interactions:
- request:
    body: <?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns:ns1="http://cliente.bean.master.sigep.bsb.correios.com.br/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
      xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><ns0:Body><ns1:consultaCEP><cep>70002900</cep></ns1:consultaCEP></ns0:Body></SOAP-ENV:Envelope>
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['403']
      Content-Type: [text/xml; charset=utf-8]
      SOAPAction:
      - !!binary |
        IiI=
      User-Agent: [python-requests/2.10.0]
    method: POST
    uri: https://apphom.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA3VRW04DMQy8StQDxMv+IFYmUhfKZ8XjBNnEtJGySZRkERyKU3AxHGhR94Of2DMj
        z1gOlqjTsAtv5GMi8T77UIbG3W6OtaYBoJgjzbpIlhovYz5Aa4BOQ7BR+OMyRvuhMJR+MDGUxVd9
        t3t8ppIYna1Z/XM23lGoJCfSQXJEpSyLO1CSU5mkiTmTi4WbWU65pWSqSw4KJ+1yjmpbtNjHXAnh
        xKChpK67rutvug6hITTOaktqzLp8fXqnmf5lkI2Tp5l34ElYoQvQrzWGFKx6GffiadE2a3ElRh9N
        FFuEpqCzirP5xeVV3T8gcEE47w7/3IeViyPC6lvUN7yWohymAQAA
    headers:
      Connection: [Keep-Alive]
      Content-Encoding: [gzip]
      Content-Length: ['267']
      Content-Type: [text/xml;charset=UTF-8]
      Date: ['Tue, 21 Jun 2016 04:17:46 GMT']
      Keep-Alive: ['timeout=5, max=100']
      Vary: ['Accept-Encoding,User-Agent']
    status: {code: 200, message: OK}
version: 1
